## Aggregations and Queries in pandas

In [notebook 4](04-pandas-basics.ipynb) we saw that pandas provides some useful structures, namely `Series` and `DataFrames`, and we perfomed some basic manipulations of these structures. 

Both `Series` and `DataFrames` have a resemblance to a classic spreadsheet or database. In this notebook we will see how pandas supports aggregations and transformations which are traditionally associated with relational database and SQL.

We begin by defining a pandas DataFrame that is very similar to the DataFrame used in the previous notebook:

In [1]:
import numpy as np
import pandas as pd

data = {'film':['Little Women', 'Cats', 'Jumanji', 'Star Wars', 'Yesterday'], 
       'mean views':[908, 102, 3604, 1145, 795],
       'date': [np.datetime64('2019-12-25'), np.datetime64('2019-12-20'), 
                np.datetime64('2019-12-04'), np.datetime64('2019-12-18'), np.datetime64('2019-06-28')],
        'month':['Dec', 'Dec', 'Dec', 'Dec', 'Jun'],
       'run time':[135, 110, 123, 142, 116],
       'theaters':[1093,987,4038,4874, 3860],
       'rating':[4,3,3,4,4]
    }

In [2]:
movie_df = pd.DataFrame(data) 

movie_df

           film  mean views       date month  run time  theaters  rating
0  Little Women         908 2019-12-25   Dec       135      1093       4
1          Cats         102 2019-12-20   Dec       110       987       3
2       Jumanji        3604 2019-12-04   Dec       123      4038       3
3     Star Wars        1145 2019-12-18   Dec       142      4874       4
4     Yesterday         795 2019-06-28   Jun       116      3860       4

It is common to want to group such data by one column of the data frame.

The pandas `.groupby()` function allows us to create a grouped object, which is organised based on the columns passed in the argument of the function.

In [3]:
grouped = movie_df.groupby('rating')
grouped

You can see that `grouped` is a specific pandas object and although we can't easily view such objects we are able to apply functions to those groups. Let's try taking the mean across groups:

In [4]:
grouped.mean()

         mean views  run time     theaters
rating
3       1853.000000     116.5  2512.500000
4        949.333333     131.0  3275.666667

The data now has a `rating` key. The `.mean()` acts on all numeric columns of the DataFrame and returns the mean value across all entries which share the same rating.

We can also pass a python list of column names to the `.groupby()` function. The DataFrame will be grouped by all of the list entries, in the order that they are given:

In [5]:
grouped2 = movie_df.groupby(['rating', 'month'])
grouped2.mean()

              mean views  run time  theaters
rating month
3      Dec        1853.0     116.5    2512.5
4      Dec        1026.5     138.5    2983.5
       Jun         795.0     116.0    3860.0

We can see that all films with rating `3` were released in December, and as such only one row corresponds to rating `3`. However, films with rating 4 were released in both December and June, hence there are two rows for this rating.

## Querying by values

We often want the subset of a dataset that has a particular value.  Pandas makes that easy!  Let's see how to find the movies that were released in December:

In [6]:
movie_df[movie_df["month"] == "Dec"]

           film  mean views       date month  run time  theaters  rating
0  Little Women         908 2019-12-25   Dec       135      1093       4
1          Cats         102 2019-12-20   Dec       110       987       3
2       Jumanji        3604 2019-12-04   Dec       123      4038       3
3     Star Wars        1145 2019-12-18   Dec       142      4874       4

Write an expression to find all of the films with fewer than 1,000 mean views:

In [10]:
# Write an expression to select every row in movie_df with fewer than 1000 mean views

           film  mean views       date month  run time  theaters  rating
0  Little Women         908 2019-12-25   Dec       135      1093       4
1          Cats         102 2019-12-20   Dec       110       987       3
4     Yesterday         795 2019-06-28   Jun       116      3860       4